using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ConsoleGame_ATB.Scene
{
    internal class StoreScene
    {
        private const int WAIT_TICK = 1000 / 50;

        string[] s = new string[Define.Map_SizeY];
        List<string> image = new List<string>()
        {
            {"..............................:-!!=.!**!*!!!!!!!**!**=:~, ~!!:.,......................~!-."},
            {"..............................;*;;*~-===*!!!!!!*$=*!!;!=;,*!;= ;......................:;-."},
            {".............................,-!!*$!!;;;;*=!!*=;::::~~::;*=!!! =......................;;-."},
            {".............................!*!=:~:::~~::;=*!::::~~~:::::!$!!.=......................;;-."},
            {".............................!*=~::::::~~::;;:::::~~~~:::::;$*:*......................;;-."},
            {".............................~=~::::::::~:::::::::~~~::::::::$;=......................;;-."},
            {".............................~::::::::::;::;:::;;~~:::::::::::=:......................;;-."},
            {"............,=:*!............=::::::::::*$!:;:*$=*~:::::::::::~~......................::-."},
            {"..........!*;   ,~..........-!::::::::::=$$!;*=$=$;:::::::::~::!......................:;-."},
            {".,,.,~:;;;.      =..........=:::::::::::*,,:~-----*:::::::::::~:~.....................~;-."},
            {".;.,!...        .:..........!~::::::::::*.       ,:;:::::::::~~~=...................-=;!-."},
            {";               ,!.........:~~:::~::::::!.       .,=:::::::~~~-,;...................-!!!-."},
            {":             .,=-.........=.~:~~~::::::;.        ,!::::::~~~~. -:....................;;,."},
            {"~        .,,..-;!..........~  ~~-~~::::;~.        .-*~::~~,-...-,$*===*!;;;!!****====$===="},
            {";.   ,.,.,,..;;,:.........~.,,.. -~;~~~*,          ,!~~~~-   ~~~:~#$$=*!!;:~~~~~~~~~~----~"},
            {"=,,..,.;##;--,..-!~~~~~~~~#-~~~, .-!...!.          .-!~~    -~~:~:*-----------------------"},
            {",=-!=$!-,!;     ,=-!=!!!**~~::~~-- !.,!-::*    ==-  ,!.. .~-~:~::~*,......................"},
            {"..:,.    ..     ,!,!=....!-::::::~-!~:!.- .-  ~  ;  .~;,~~::::::::::...............~=$,..."},
            {"..~-            .:.*#...-!~:::::::;;:$,              ,*:~~::::::::~=-............*=-  :..."},
            {"..~:             --*#..,!-::::::::=:*~         ,,    .-*::::::::::;~:,..........;.   :~..."},
            {"..,;             -!=#..-~::::::::;!!~.   $@,   @@     ,!;:::::::::*;*-..........;.   :...."},
            {"..,!.            ,=*$.-$::::::::;==,,    !#    ~-      ,$:::::::::::!*,..........*$. ;...."},
            {"...!             .*=$,#:::::::::;*~.                   .-*::!:::::::;*~............; ~-..."},
            {"...!             .:*$$~::::::::;*~.         *!          ,~!;*;::::!#,~$~...........~- ;..."},
            {".-;             . ~$-:::::::::!$-                        ,;!!=;:::!!, ,!:...........! -~.."},
            {"=-                ,!;;::::::!$*.            ,~   ,       .:~**:*::;#*.   !..........,~ ;.."},
            {"               .  !.*$*!*$$;,.!.         !-:@@@#=.        ~.,==,=;:!$,    *,.........;  ;."},
            {"                 ~  .,,,,... .;,          -@@@@@.         -:.,~~.;=!$-.    :.........,: -~"},
            {"                ,;           .,-          .@@@@@         .-=, .,.,.-$*.    *..........;. :"},
            {"             .,.,-           ,,*           #@@@$         ,:*~,  ...        !,..........:  "},
            {"          ..,,,,-*          .,==-          ~@@#.        .,$!=,.            *...........;  "},
            {"    ...,,,,.,,~;!:~        .:=*!=,           .          ,*!!*$,,           :...........: ."},
            {",.,.,.,,.,-~;*:---~=-,,,,~*;!!*!*;.                    ,;**!!*#~,.        !,....----~~~*;*"},
            {":~-~::;!**!~-------=!~~~----;!*!!*;,                 .,!*!!!!!$~*:-,   .,*,....---~~::::~~"},
            {"-~~~-------------,-=!-~~-----;!!!**!-,.            .,~=!!!!!*!=---:****!~-,....~!;;!!!!!!!"},
            {",,------------,...-$!-!;-----*!*!!!!=;-.,........,,~*=!!!!!!!!$::::;;;::::---,,~*;!!!!!!!!"},
            {"....,,,,,,,........$!--~:::;;$;!!!!!!!=$;:~----~:*$#=!!!!!!!!!$!!!*******=*====**!!*******"},
            {".......,--~~::;;:;!*!*=***!;;;!!!!!!!!=$*$$*$$$$$===$=!**!!!!!=*********==*****!=**======="},
            {":;!!*===*************===*******!*!**!=$===$:$==$===$:-=*!*!!!;------------------!!;::~~~~!"},
            {"!*!!;:~-,,,...........,--------=!===;;:#;=;=$$$===$;,.~=;!;!!=--------,,,,,,,,,,---------*"},
            {"........................,-----;!*=$**;,;#=$$==$$$*-,,-:*~!!!*~----,,............,--------*"},
            {"............................---~-==!:-!:-;*==*;-.,-~;;--*-*!*-----,..............--------;"},
            {"............................-----*=*..~-~::::::::~-~,,-,;-;*-------...............-------~"},
            {"............................-----*=~ .;. .........,:. .-;!~--------................,------"},
            {"...........................,-----*$:~,;...........,;-:;~ !---------.................,-----"}
        };

        //string 값 계산해서 좌우에 space padding

        int SizeX { get; set; }
        int SizeY { get; set; }

        public void Init(int Xsize, int Ysize)
        {
            SizeX = image[0].Length;
            SizeY = image.Count();

            s = image.ToArray();
        }

        void Render(Menu menu, TextBoxInterface textBox)
        {
            for (int y = 0; y < SizeY; y++)
            {
                for (int x = 0; x < SizeX; x++)
                {
                    /*if (x == 0 || x == SizeX-1 || y == 0 || y == SizeY - 1)
                    {
                        Console.ForegroundColor = ConsoleColor.Red;
                        Console.Write("□");
                    }
                    else
                    {*/
                    if(y < Define.Map_SizeY && x < SizeX)
                    {
                        Console.ForegroundColor = ConsoleColor.DarkGray;
                        Console.Write(s[y][x]);
                    }
                    //}
                }

                Console.ForegroundColor = ConsoleColor.Yellow;
                menu.PrintMenu(y);

                if (y < Define.Map_SizeY)
                {
                    Console.WriteLine();
                }
            }
            Console.ForegroundColor = ConsoleColor.DarkGray;
            Console.WriteLine();

            
            textBox.PrintTextBox(); //값을 넣어서 해결 하자.
        }
        public void StoreLoad()
        {
            bool escButton = true;
            int lastTick = System.Environment.TickCount;

            Init(Define.Map_SizeX, Define.Map_SizeY);
            
            Menu _menu = new Menu();                            // 상점 메뉴 별도
            TextBoxInterface textBox = new TextBoxInterface(); // 텍스트 박스 별도
            textBox.init();
            textBox.boxStr[2] = "□  떼미이이이이이 물건 판다ㅏㅏㅏ";

            while (escButton)
            {
                #region 프레임 관리
                int currentTick = System.Environment.TickCount;
                int elapsedTick = currentTick - lastTick;

                if (elapsedTick < WAIT_TICK)
                    continue;
                
                lastTick = currentTick;
                #endregion

                Console.SetCursorPosition(0, 0);

                Render(_menu, textBox);
                MenuPressCheck(_menu);
            }
        }

        private bool MenuPressCheck(Menu _menu)
        {
            if (Console.KeyAvailable)
            {
                ConsoleKeyInfo consoleKey = Console.ReadKey();
                int menu = (int)_menu.MAIN_MENU;

                switch (consoleKey.Key)
                {
                    // 메뉴 움직이기
                    case ConsoleKey.UpArrow:
                        // 예외 처리
                        /*if (_menu.MAIN_MENU == MainMenu.PlayerInfo)
                            _menu.CurssorMove(4);
                        else
                            _menu.CurssorMove(menu - 1);*/
                        break;
                    case ConsoleKey.DownArrow:

                        /*if (_menu.MAIN_MENU == MainMenu.Setting)
                            _menu.CurssorMove(0);
                        else
                            _menu.CurssorMove(menu + 1);*/
                        break;
                    case ConsoleKey.Enter:
                        // 해당 안에 시드로 들어간다.
                        // 내정보, 동료정보 는 그냥 Esc만 먹히게
                        break;
                    case ConsoleKey.Escape:
                    // 탈출할 게 남아있다면, break. 아니면 true
                    /*if()
                    {
                        break;
                    }*/
                    case ConsoleKey.Tab:
                        return true;
                }
            }
            return false;
        }
    }
}

/*
 우리는 시드 가르기를 할꺼에요
상점 창 안에 
대화한다, 산다, 판다, 나간다
넣고
산다, 판다 안에는 
산다 = 떼미 아이템 리스트
판다 = 내 아이템리스트 
나열.

A 안에 
B, C, D F
 */















































































































































































































